app/views/home/index.html.erb

SELECT  "neil_tyagis".* FROM "neil_tyagis" WHERE "neil_tyagis"."voter" = ? LIMIT 1  [["voter", "1"]]
SELECT  "rajiv_ranjans".* FROM "rajiv_ranjans" WHERE "rajiv_ranjans"."voter" = ? LIMIT 1  [["voter", "1"]]
---
<h1>Hello, <%= current_user.name%></h1>
<%if RajivRanjan.find_by_voter(current_user.id)==nil && NeilTyagi.find_by_voter(current_user.id)==nil%>