app/views/home/see.html.erb

<%self_rajiv=70116403215%>
<%neil=NeilTyagi.where(:self=>self_neil)%>
<%rajiv=RajivRanjan.where(:self=>self_rajiv)%>
---
SELECT  "neil_tyagis".* FROM "neil_tyagis" WHERE "neil_tyagis"."self" = ?  ORDER BY "neil_tyagis"."id" ASC LIMIT 1  [["self", "40816403215"]]
SELECT  "rajiv_ranjans".* FROM "rajiv_ranjans" WHERE "rajiv_ranjans"."self" = ?  ORDER BY "rajiv_ranjans"."id" ASC LIMIT 1  [["self", "70116403215"]]

   <%neil.each do |neil|%>
   <li><%= User.find_by_id(neil.voter).name%></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]